'''
Условие
Дано натуральное число. Найдите число десятков в его десятичной записи.
'''
#**************************************************

a = int(input())

if a<10:
	b=0
elif 10<=a<100:
	b=a//10
else:
	b=(a%100)//10
print(b)


