'''
Условие
Дано трехзначное число. Найдите сумму его цифр.
'''
#**************************************************
a=int(input())
a1=a//100
a2=(a-a1*100)//10
a3=(a-a1*100-a2*10)//1
print(a1+a2+a3)


