'''
Условие
Дана строка. Удалите из нее все символы, чьи индексы делятся на 3.
'''
#**************************************************

s ="0123456789"#input()
a=len(s)
for i in range(0,a):
	if i%3==0 and i/3>0:
		s=s.replace(s[i],'@')
print(s.replace('@',''))
