'''
Условие
Дано два числа a и b. 
Выведите гипотенузу треугольника с заданными катетами.
'''
#**************************************************
a=int(input())
b=int(input())
gip=(a**2+b**2)**0.5
print(gip)


