'''
Условие
Дано положительное действительное число X. 
Выведите его дробную часть.
'''
#**************************************************
a = float(input())
print(a%1)