'''
Условие
Дано нечетное число n. Создайте двумерный массив из n×n элементов, заполнив 
его символами "." (каждый элемент массива является строкой из одного символа). 
Затем заполните символами "*" среднюю строку массива, средний столбец массива, 
главную диагональ и побочную диагональ. В результате единицы в массиве должны 
образовывать изображение звездочки. Выведите полученный массив на экран, разделяя 
элементы массива пробелами.
''' 
m = int(input())
a = [['.'] * m for i in range(m)]
for i in range(m):
    for j in range(m):
        if i==m//2:
            a[i][j]='*'
        elif j==m//2:
            a[i][j]='*'
        elif i==j:
            a[i][j]='*'
        elif i+j==m-1:
            a[i][j]='*'
for row in a:
    print(' '.join(row))


'''
Решение разработчиков
n = int(input())
a = [['.'] * n for i in range(n)]
for i in range(n):
    a[i][i] = '*'
    a[n // 2][i] = '*'
    a[i][n // 2] = '*'
    a[i][n - i - 1] = '*'
for row in a:
    print(' '.join(row))

'''