'''
Условие
Дана строка. Замените в этой строке все появления буквы h 
на букву H, кроме первого и последнего вхождения.
'''
#**************************************************

s =input()
start=s.find('h')
stop=s.rfind('h')
str1=s[:start+1]
str2=s[stop:]
str3=s[start+1:stop].replace('h','H')
print(str1+str3+str2)