'''
Условие
Как известно, в США президент выбирается не прямым голосованием, а путем двухуровневого 
голосования. Сначала проводятся выборы в каждом штате и определяется победитель выборов в 
данном штате. Затем проводятся государственные выборы: на этих выборах каждый штат имеет 
определенное число голосов — число выборщиков от этого штата. На практике, все выборщики от 
штата голосуют в соответствии с результами голосования внутри штата, то есть на заключительной 
стадии выборов в голосовании участвуют штаты, имеющие различное число голосов.

В первой строке дано количество записей. Далее, каждая запись содержит фамилию кандидата и 
число голосов, отданных за него в одном из штатов. Подведите итоги выборов: для каждого из 
участника голосования определите число отданных за него голосов. Участников нужно выводить в 
алфавитном порядке.

''' 
n=int(input())
a={}
for i in range(n):
    key,val=[str(i) for i in input().split()]
    if key not in a.keys():
        a[key]=int(val)
    else:
        a[key]=a[key]+int(val)
    

list_keys = list(a.keys())
list_keys.sort()
for i in list_keys:
    print(i, a[i])



'''
num_votes = {}
for _ in range(int(input())):
    candidate, votes = input().split()
    num_votes[candidate] = num_votes.get(candidate, 0) + int(votes)

for candidate, votes in sorted(num_votes.items()):
    print(candidate, votes)



'''