'''
Условие
Дана строка. Удалите из нее все символы, чьи индексы делятся на 3.
'''
#**************************************************

s ="Python"#input()
a=len(s)
for i in range(0,a):
	if i%3==0:
		print(i)
		str1=s[i]
		s=s.replace(str1,'',1)
print(s)
